In [2]:
import pandas as pd

In [8]:
raw_data = {
    'city':['Tripoli', 'Sydney', 'Tripoli', 'Rome', 'Rome', 'Tripoli', 'Rome', 'Sydney', 'Sydney'],
    'rank':['1st','2nd','1st','2nd','1st','2nd','1st','2nd','1st'],
    'score1': [44,48,39,41,38,44,34,54,61],
    'score2': [67,63,55,70,64,75,45,66,72]
}
df = pd.DataFrame(raw_data,
                  index = pd.Index(['A','B','C','D','E','F','G','H','I'], name = 'letter'),
                  columns = pd.Index(['city','rank','score1','score2'], name = 'attributes')
                 )
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
D              Rome  2nd      41      70
E              Rome  1st      38      64
F           Tripoli  2nd      44      75
G              Rome  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

In [9]:
df['city'].replace(['Rome','Tripoli'],['Rome', 'Benghazi'], inplace=True)
df

attributes      city rank  score1  score2
letter
A           Benghazi  1st      44      67
B             Sydney  2nd      48      63
C           Benghazi  1st      39      55
D               Rome  2nd      41      70
E               Rome  1st      38      64
F           Benghazi  2nd      44      75
G               Rome  1st      34      45
H             Sydney  2nd      54      66
I             Sydney  1st      61      72

In [10]:
df.iloc[0,0] # integer based location

'Benghazi'

In [16]:
df.iloc[3,0] = 'Shanghai'
df

attributes      city rank  score1  score2
letter
A              Kyoto  1st      44      67
B              Tokyo  2nd      48      63
C           Benghazi  1st      39      55
D           Shanghai  2nd      41      70
E               Rome  1st      38      64
F           Benghazi  2nd      44      75
G               Rome  1st      34      45
H             Sydney  2nd      54      66
I             Sydney  1st      61      72

In [11]:
df.iat[0,0]

'Benghazi'

In [13]:
df.iat[0,0] = 'Kyoto'
df

attributes      city rank  score1  score2
letter
A              Kyoto  1st      44      67
B             Sydney  2nd      48      63
C           Benghazi  1st      39      55
D               Rome  2nd      41      70
E               Rome  1st      38      64
F           Benghazi  2nd      44      75
G               Rome  1st      34      45
H             Sydney  2nd      54      66
I             Sydney  1st      61      72

In [14]:
df.at['B','city'] = 'Tokyo'
df

attributes      city rank  score1  score2
letter
A              Kyoto  1st      44      67
B              Tokyo  2nd      48      63
C           Benghazi  1st      39      55
D               Rome  2nd      41      70
E               Rome  1st      38      64
F           Benghazi  2nd      44      75
G               Rome  1st      34      45
H             Sydney  2nd      54      66
I             Sydney  1st      61      72